{
    "Group1": [
      {
        "word": "Abound",
        "info": "Part of Speech: Verb<br>Definition: To exist in large numbers or amounts.<br>Example: The forests abound with wildlife during spring."
      },
      {
        "word": "Amorphous",
        "info": "Part of Speech: Adjective<br>Definition: Lacking a defined shape or form; vague.<br>Example: The artist painted an amorphous figure that left much to interpretation."
      },
      {
        "word": "Austere",
        "info": "Part of Speech: Adjective<br>Definition: Severe or strict in manner, attitude, or appearance; plain and simple.<br>Example: The monk led an austere lifestyle, devoid of luxuries."
      },
      {
        "word": "Belie",
        "info": "Part of Speech: Verb<br>Definition: To give a false impression; to contradict.<br>Example: Her calm demeanor belied the anxiety she felt inside."
      },
      {
        "word": "Capricious",
        "info": "Part of Speech: Adjective<br>Definition: Given to sudden and unaccountable changes of mood or behavior.<br>Example: The capricious weather made it hard to plan the outdoor event."
      },
      {
        "word": "Cerebral",
        "info": "Part of Speech: Adjective<br>Definition: Intellectual rather than emotional or physical.<br>Example: The book appealed to readers with a cerebral approach to philosophy."
      },
      {
        "word": "Congenial",
        "info": "Part of Speech: Adjective<br>Definition: Pleasant because of personality, qualities, or interests that are similar to one's own.<br>Example: She found her new colleagues to be congenial and easy to work with."
      },
      {
        "word": "Conspicuous",
        "info": "Part of Speech: Adjective<br>Definition: Easily seen or noticed; attracting attention.<br>Example: Her bright red coat made her conspicuous in the crowd."
      },
      {
        "word": "Cursory",
        "info": "Part of Speech: Adjective<br>Definition: Hasty and therefore not thorough or detailed.<br>Example: He gave the document a cursory glance before signing it."
      },
      {
        "word": "Daunting",
        "info": "Part of Speech: Adjective<br>Definition: Intimidating or causing one to feel apprehensive.<br>Example: The prospect of moving to a new city was daunting but exciting."
      },
      {
        "word": "Deify",
        "info": "Part of Speech: Verb<br>Definition: To worship or regard as a god.<br>Example: The fans seemed to deify the actor, treating him like a deity."
      },
      {
        "word": "Didactic",
        "info": "Part of Speech: Adjective<br>Definition: Intended to teach, often in a way that is overly moralistic or patronizing.<br>Example: The teacher’s didactic tone made the lecture dull."
      },
      {
        "word": "Disseminate",
        "info": "Part of Speech: Verb<br>Definition: To spread or disperse widely.<br>Example: The organization works to disseminate information about health issues."
      },
      {
        "word": "Feasible",
        "info": "Part of Speech: Adjective<br>Definition: Possible to do easily or conveniently.<br>Example: Completing the project within the deadline seemed feasible."
      },
      {
        "word": "Flout",
        "info": "Part of Speech: Verb<br>Definition: To openly disregard a rule or convention.<br>Example: He chose to flout the traffic laws by speeding."
      },
      {
        "word": "Homogeneous",
        "info": "Part of Speech: Adjective<br>Definition: Consisting of parts or elements that are all the same kind.<br>Example: The town has a largely homogeneous population."
      },
      {
        "word": "Humdrum",
        "info": "Part of Speech: Adjective<br>Definition: Lacking excitement or variety; dull.<br>Example: Her routine had become humdrum, with little variation day to day."
      },
      {
        "word": "Insipid",
        "info": "Part of Speech: Adjective<br>Definition: Lacking flavor, vigor, or interest.<br>Example: The soup was insipid and lacked any seasoning."
      },
      {
        "word": "Loquacious",
        "info": "Part of Speech: Adjective<br>Definition: Tending to talk a great deal; talkative.<br>Example: The loquacious guest dominated the conversation at dinner."
      },
      {
        "word": "Misanthropic",
        "info": "Part of Speech: Adjective<br>Definition: Having a dislike of humankind.<br>Example: His misanthropic views made it hard for him to trust people."
      },
      {
        "word": "Misnomer",
        "info": "Part of Speech: Noun<br>Definition: A wrong or inaccurate name or designation.<br>Example: Calling the small pond a ‘lake’ was a misnomer."
      },
      {
        "word": "Negligent",
        "info": "Part of Speech: Adjective<br>Definition: Failing to take proper care in doing something.<br>Example: The company was found negligent in maintaining workplace safety."
      },
      {
        "word": "Obsequious",
        "info": "Part of Speech: Adjective<br>Definition: Excessively eager to please or obey.<br>Example: The assistant's obsequious behavior annoyed his colleagues."
      },
      {
        "word": "Placate",
        "info": "Part of Speech: Verb<br>Definition: To make someone less angry or hostile.<br>Example: She tried to placate her friend after their argument."
      },
      {
        "word": "Proclivity",
        "info": "Part of Speech: Noun<br>Definition: A tendency to choose or do something regularly.<br>Example: He has a proclivity for solving complex puzzles."
      },
      {
        "word": "Puerile",
        "info": "Part of Speech: Adjective<br>Definition: Childishly silly and immature.<br>Example: His puerile sense of humor often annoyed his coworkers."
      },
      {
        "word": "Quixotic",
        "info": "Part of Speech: Adjective<br>Definition: Extremely idealistic; unrealistic and impractical.<br>Example: Her quixotic plans to save the world were admirable but unfeasible."
      },
      {
        "word": "Spendthrift",
        "info": "Part of Speech: Noun<br>Definition: A person who spends money extravagantly.<br>Example: Despite earning a high salary, he was a notorious spendthrift."
      },
      {
        "word": "Taciturn",
        "info": "Part of Speech: Adjective<br>Definition: Reserved or uncommunicative in speech.<br>Example: The taciturn man rarely engaged in small talk."
      },
      {
        "word": "Wary",
        "info": "Part of Speech: Adjective<br>Definition: Feeling or showing caution about possible dangers.<br>Example: She was wary of strangers offering unsolicited help."
      }
    ]
    ,
    "Group2": [
      {
        "word": "Adulterate",
        "info": "Part of Speech: Verb<br>Definition: To make something poorer in quality by adding another substance.<br>Example: The company was accused of adulterating its products with cheap fillers."
      },
      {
        "word": "Advocate",
        "info": "Part of Speech: Verb / Noun<br>Definition:<br>(Verb): To publicly recommend or support.<br>(Noun): A person who publicly supports a cause or policy.<br>Example:<br>She advocates for equal pay in the workplace.<br>He is an advocate of environmental protection."
      },
      {
        "word": "Aggrandize",
        "info": "Part of Speech: Verb<br>Definition: To increase the power, status, or wealth of someone or something.<br>Example: He used every opportunity to aggrandize his position within the company."
      },
      {
        "word": "Alacrity",
        "info": "Part of Speech: Noun<br>Definition: Brisk and cheerful readiness.<br>Example: She accepted the invitation with alacrity."
      },
      {
        "word": "Ambivalent",
        "info": "Part of Speech: Adjective<br>Definition: Having mixed feelings or contradictory ideas about something or someone.<br>Example: He felt ambivalent about moving to a new city for the job."
      },
      {
        "word": "Ameliorate",
        "info": "Part of Speech: Verb<br>Definition: To make something better or improve it.<br>Example: The government implemented reforms to ameliorate living conditions in rural areas."
      },
      {
        "word": "Amenable",
        "info": "Part of Speech: Adjective<br>Definition: Open and responsive to suggestions; easily persuaded or controlled.<br>Example: The staff was amenable to changes in the work schedule."
      },
      {
        "word": "Anachronistic",
        "info": "Part of Speech: Adjective<br>Definition: Belonging to a period other than the one being portrayed; outdated.<br>Example: The use of typewriters in the office seemed anachronistic."
      },
      {
        "word": "Audacious",
        "info": "Part of Speech: Adjective<br>Definition: Showing a willingness to take bold risks; daring or impudent.<br>Example: His audacious plan to start a business with no funding surprised everyone."
      },
      {
        "word": "Avaricious",
        "info": "Part of Speech: Adjective<br>Definition: Having an extreme greed for wealth or material gain.<br>Example: The avaricious landlord raised the rent exorbitantly."
      },
      {
        "word": "Banal",
        "info": "Part of Speech: Adjective<br>Definition: Lacking in originality, so as to be obvious and boring.<br>Example: The film’s plot was banal and predictable."
      },
      {
        "word": "Benign",
        "info": "Part of Speech: Adjective<br>Definition: Gentle and kind; not harmful.<br>Example: The tumor was found to be benign, much to everyone’s relief."
      },
      {
        "word": "Brazen",
        "info": "Part of Speech: Adjective<br>Definition: Bold and without shame.<br>Example: She made a brazen attempt to steal the show."
      },
      {
        "word": "Calumny",
        "info": "Part of Speech: Noun<br>Definition: A false statement made to damage someone’s reputation; slander.<br>Example: The politician was the target of repeated calumnies during the campaign."
      },
      {
        "word": "Candid",
        "info": "Part of Speech: Adjective<br>Definition: Truthful and straightforward; frank.<br>Example: The photographer captured candid moments at the event."
      },
      {
        "word": "Castigate",
        "info": "Part of Speech: Verb<br>Definition: To criticize or punish someone severely.<br>Example: The teacher castigated the student for cheating on the exam."
      },
      {
        "word": "Caustic",
        "info": "Part of Speech: Adjective<br>Definition: Sarcastic in a scathing and bitter way; capable of burning or corroding.<br>Example: Her caustic remarks hurt his feelings."
      },
      {
        "word": "Construe",
        "info": "Part of Speech: Verb<br>Definition: To interpret or understand something in a particular way.<br>Example: His silence was construed as agreement."
      },
      {
        "word": "Contrite",
        "info": "Part of Speech: Adjective<br>Definition: Feeling or expressing remorse or penitence.<br>Example: She gave a contrite apology for her mistake."
      },
      {
        "word": "Convoluted",
        "info": "Part of Speech: Adjective<br>Definition: Extremely complex and difficult to follow.<br>Example: The convoluted instructions left everyone confused."
      },
      {
        "word": "Covet",
        "info": "Part of Speech: Verb<br>Definition: To desire something belonging to someone else.<br>Example: He covets his neighbor's new car."
      },
      {
        "word": "Craven",
        "info": "Part of Speech: Adjective<br>Definition: Lacking in courage; cowardly.<br>Example: The craven decision to flee the battlefield was criticized."
      },
      {
        "word": "Decorum",
        "info": "Part of Speech: Noun<br>Definition: Behavior in keeping with good taste and propriety.<br>Example: She maintained her decorum even during the heated argument."
      },
      {
        "word": "Deft",
        "info": "Part of Speech: Adjective<br>Definition: Demonstrating skill and cleverness.<br>Example: The artist’s deft brushstrokes created a stunning portrait."
      },
      {
        "word": "Demur",
        "info": "Part of Speech: Verb<br>Definition: To raise doubts or objections; to hesitate.<br>Example: She agreed to the plan without demur."
      },
      {
        "word": "Derivative",
        "info": "Part of Speech: Adjective / Noun<br>Definition:<br>(Adjective): Imitative of another person’s work; unoriginal.<br>(Noun): Something based on another source.<br>Example: The song was criticized for being derivative of older hits."
      },
      {
        "word": "Desiccate",
        "info": "Part of Speech: Verb<br>Definition: To remove the moisture from something; to dry thoroughly.<br>Example: The hot sun desiccated the crops in the field."
      },
      {
        "word": "Diatribe",
        "info": "Part of Speech: Noun<br>Definition: A forceful and bitter verbal attack.<br>Example: The article was a diatribe against political corruption."
      },
      {
        "word": "Incredulous",
        "info": "Part of Speech: Adjective<br>Definition: Unwilling or unable to believe something; skeptical.<br>Example: He gave her an incredulous look when she told him the news."
      }
    ],
    "Group3": [
      {
        "word": "Abate",
        "info": "Part of Speech: Verb<br>Definition: To reduce in amount, degree, or intensity.<br>Example: The storm finally began to abate after several hours."
      },
      {
        "word": "Abjure",
        "info": "Part of Speech: Verb<br>Definition: To formally renounce or reject something.<br>Example: He abjured his former lifestyle and embraced a more disciplined one."
      },
      {
        "word": "Anomalous",
        "info": "Part of Speech: Adjective<br>Definition: Deviating from what is standard, normal, or expected.<br>Example: The scientist discovered an anomalous result in the experiment."
      },
      {
        "word": "Antipathy",
        "info": "Part of Speech: Noun<br>Definition: A deep-seated feeling of dislike or aversion.<br>Example: She felt an intense antipathy toward the new policies."
      },
      {
        "word": "Arcane",
        "info": "Part of Speech: Adjective<br>Definition: Understood by few; mysterious or secret.<br>Example: The professor’s lecture on quantum mechanics was full of arcane concepts."
      },
      {
        "word": "Arduous",
        "info": "Part of Speech: Adjective<br>Definition: Involving or requiring strenuous effort; difficult and tiring.<br>Example: The climb to the summit was arduous, but the view was worth it."
      },
      {
        "word": "Artless",
        "info": "Part of Speech: Adjective<br>Definition: Without deceit or guile; innocent and simple.<br>Example: Her artless charm made her instantly likable."
      },
      {
        "word": "Ascetic",
        "info": "Part of Speech: Adjective / Noun<br>Definition: (Adjective): Characterized by severe self-discipline and abstention from indulgence.<br>(Noun): A person who practices severe self-discipline and abstains from all forms of indulgence.<br>Example: He led an ascetic life, living in a small room and owning few possessions. The ascetic spent years meditating in isolation."
      },
      {
        "word": "Assuage",
        "info": "Part of Speech: Verb<br>Definition: To make an unpleasant feeling less intense; to relieve.<br>Example: The medicine helped to assuage the pain."
      },
      {
        "word": "Betray",
        "info": "Part of Speech: Verb<br>Definition: To reveal or disclose something unintentionally; to be disloyal to someone.<br>Example: He betrayed his friend's trust by sharing their secrets."
      },
      {
        "word": "Bucolic",
        "info": "Part of Speech: Adjective<br>Definition: Relating to the pleasant aspects of the countryside and country life.<br>Example: The bucolic landscape was a peaceful escape from city life."
      },
      {
        "word": "Burgeon",
        "info": "Part of Speech: Verb<br>Definition: To begin to grow or increase rapidly.<br>Example: The city's population began to burgeon as more people moved there for work."
      },
      {
        "word": "Cacophonous",
        "info": "Part of Speech: Adjective<br>Definition: Involving or producing a harsh, discordant mixture of sounds.<br>Example: The cacophonous noise of the city streets made it hard to concentrate."
      },
      {
        "word": "Canonize",
        "info": "Part of Speech: Verb<br>Definition: To officially declare a person to be a saint or to treat someone or something as a great or important figure.<br>Example: The church canonized the bishop for his acts of charity."
      },
      {
        "word": "Censure",
        "info": "Part of Speech: Verb / Noun<br>Definition: (Verb): To express severe disapproval of someone or something, typically in a formal statement.<br>(Noun): An expression of severe disapproval.<br>Example: The committee censured the executive for his unethical behavior. The senator faced censure for his controversial remarks."
      },
      {
        "word": "Chicanery",
        "info": "Part of Speech: Noun<br>Definition: The use of trickery to achieve a political, financial, or legal purpose.<br>Example: The businessman resorted to chicanery to avoid paying his taxes."
      },
      {
        "word": "Coalesce",
        "info": "Part of Speech: Verb<br>Definition: To come together to form one mass or whole.<br>Example: The two companies coalesced to become a major force in the market."
      },
      {
        "word": "Cogent",
        "info": "Part of Speech: Adjective<br>Definition: Clear, logical, and convincing.<br>Example: Her cogent argument persuaded everyone at the meeting."
      },
      {
        "word": "Compelling",
        "info": "Part of Speech: Adjective<br>Definition: Evoking interest, attention, or admiration in a powerfully irresistible way.<br>Example: The movie had a compelling plot that kept the audience on the edge of their seats."
      },
      {
        "word": "Contend",
        "info": "Part of Speech: Verb<br>Definition: To struggle to overcome a difficulty or to argue or assert something in a debate.<br>Example: The team contended with injuries but still managed to win the championship."
      },
      {
        "word": "Copious",
        "info": "Part of Speech: Adjective<br>Definition: Abundant in supply or quantity.<br>Example: She took copious notes during the lecture."
      },
      {
        "word": "Cosmopolitan",
        "info": "Part of Speech: Adjective / Noun<br>Definition: (Adjective): Familiar with and at ease in many different countries and cultures.<br>(Noun): A person who is cosmopolitan, someone who is familiar with and comfortable in many different cultures.<br>Example: New York is a cosmopolitan city with people from all over the world. He is a true cosmopolitan, having lived in several countries."
      },
      {
        "word": "Deference",
        "info": "Part of Speech: Noun<br>Definition: Respectful submission or yielding to the judgment, opinion, or will of another.<br>Example: He showed deference to his elders by listening attentively to their advice."
      },
      {
        "word": "Desultory",
        "info": "Part of Speech: Adjective<br>Definition: Lacking a clear plan or purpose; aimless.<br>Example: The conversation was desultory, jumping from topic to topic without any clear direction."
      },
      {
        "word": "Diffident",
        "info": "Part of Speech: Adjective<br>Definition: Modest or shy because of a lack of self-confidence.<br>Example: She was diffident about speaking in public."
      },
      {
        "word": "Dilatory",
        "info": "Part of Speech: Adjective<br>Definition: Slow to act or procrastinating.<br>Example: His dilatory behavior caused delays in the project."
      },
      {
        "word": "Equivocate",
        "info": "Part of Speech: Verb<br>Definition: To use ambiguous language to conceal the truth or avoid committing to a position.<br>Example: The politician equivocated when asked about his stance on the issue."
      },
      {
        "word": "Polarize",
        "info": "Part of Speech: Verb<br>Definition: To divide or cause to divide into two sharply contrasting groups or opinions.<br>Example: The debate over the new policy began to polarize the community."
      },
      {
        "word": "Prodigal",
        "info": "Part of Speech: Adjective / Noun<br>Definition: (Adjective): Spending money or resources freely and recklessly.<br>(Noun): A person who spends money in an extravagant, wasteful way.<br>Example: The prodigal son returned after spending all his inheritance. His prodigal lifestyle eventually led him to bankruptcy."
      },
      {
        "word": "Verbose",
        "info": "Part of Speech: Adjective<br>Definition: Using more words than necessary; wordy.<br>Example: His verbose explanation only confused the audience further."
      }
    ]  
  }
  